Please read your project instructions in the project description file.
This is an example for STUDENT-COURSE example.

In [1]:
%load_ext sql

C:\Anaconda3\lib\site-packages\IPython\config.py:13: ShimWarning: The `IPython.config` package has been deprecated since IPython 4.0. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
C:\Anaconda3\lib\site-packages\IPython\utils\traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

Example:

Table: student

Description: Information of students are stored in this table, such as name and email.

In [2]:
%sql sqlite:///test.db

'Connected: None@test.db'

In [3]:
%%sql
DROP TABLE IF EXISTS student;
CREATE TABLE student (
    student_id varchar(255) NOT NULL UNIQUE,
    first_name varchar(255) NOT NULL DEFAULT '',
    last_name varchar(255) NOT NULL DEFAULT '',
    address varchar(255),
    gender char(2),
    PRIMARY KEY (student_id)
);

Done.
Done.

[]

In [4]:
%sql PRAGMA table_info(student);

Done.

[(0, 'student_id', 'varchar(255)', 1, None, 1),
 (1, 'first_name', 'varchar(255)', 1, "''", 0),
 (2, 'last_name', 'varchar(255)', 1, "''", 0),
 (3, 'address', 'varchar(255)', 0, None, 0),
 (4, 'gender', 'char(2)', 0, None, 0)]

In [5]:
%%sql
INSERT INTO student (student_id, first_name, last_name, address, gender)
VALUES ('s485730','Silje', 'Thomassen', 'Ilabakken 96 1481 HAGAN', 'M'),
('s129483','Matilde', 'Lavik', 'Vienvegen 219 2318 HAMAR', 'M'),
('s583048','Emma', 'Sagen', 'Nordheimveien 235 1472 FJELLHAMAR', 'F'),
('s128473','Maryam', 'Gulbrandsen', 'Blunkeslettveien 43 1809 ASKIM', 'F');

4 rows affected.

[]

In [6]:
%sql select * from student;

Done.

[('s485730', 'Silje', 'Thomassen', 'Ilabakken 96 1481 HAGAN', 'M'),
 ('s129483', 'Matilde', 'Lavik', 'Vienvegen 219 2318 HAMAR', 'M'),
 ('s583048', 'Emma', 'Sagen', 'Nordheimveien 235 1472 FJELLHAMAR', 'F'),
 ('s128473', 'Maryam', 'Gulbrandsen', 'Blunkeslettveien 43 1809 ASKIM', 'F')]

In [7]:
%%sql
DROP TABLE IF EXISTS course;
CREATE TABLE course (
    course_id varchar(255) NOT NULL UNIQUE,
    name varchar(255) NOT NULL DEFAULT '',
    teacher varchar(255) NOT NULL DEFAULT '',
    department varchar(255) NOT NULL DEFAULT '',
    credits float(2,1) NOT NULL DEFAULT 0.0,
    PRIMARY KEY (course_id)
);

Done.
Done.

[]

In [8]:
%sql PRAGMA table_info(course);

Done.

[(0, 'course_id', 'varchar(255)', 1, None, 1),
 (1, 'name', 'varchar(255)', 1, "''", 0),
 (2, 'teacher', 'varchar(255)', 1, "''", 0),
 (3, 'department', 'varchar(255)', 1, "''", 0),
 (4, 'credits', 'float(2,1)', 1, '0.0', 0)]

In [9]:
%%sql
INSERT INTO course (course_id, name, teacher, department, credits)
VALUES ('IFUD1123','Big data', 'Nils Tesdal', 'Department of Computer Science', 5),
('IFUD1048','C++ for Programmers', 'Ole Christian Eidheim', 'Department of Computer Science', 5),
('TDAT3023','3D Computer Graphics', 'Tomas Holt', 'Department of Computer Science', 15);

3 rows affected.

[]

In [10]:
%sql select * from course;

Done.

[('IFUD1123', 'Big data', 'Nils Tesdal', 'Department of Computer Science', 5.0),
 ('IFUD1048', 'C++ for Programmers', 'Ole Christian Eidheim', 'Department of Computer Science', 5.0),
 ('TDAT3023', '3D Computer Graphics', 'Tomas Holt', 'Department of Computer Science', 15.0)]

In [11]:
%%sql
DROP TABLE IF EXISTS course_enrollment;
CREATE TABLE course_enrollment (
    student_id varchar(255) NOT NULL,
    course_id varchar(255) NOT NULL,
    grade float(2,2) NOT NULL DEFAULT 0.0,
    PRIMARY KEY (student_id, course_id),
    FOREIGN KEY (student_id) REFERENCES student(student_id),
    FOREIGN KEY (course_id) REFERENCES course(course_id)
);

Done.
Done.

[]

In [12]:
%sql PRAGMA table_info(course_enrollment);

Done.

[(0, 'student_id', 'varchar(255)', 1, None, 1),
 (1, 'course_id', 'varchar(255)', 1, None, 2),
 (2, 'grade', 'float(2,2)', 1, '0.0', 0)]

In [13]:
%%sql
INSERT INTO course_enrollment (student_id, course_id, grade)
VALUES ('s485730','IFUD1123', 70),
('s485730','IFUD1048', 80),
('s129483','IFUD1048', 90),
('s129483','IFUD1123', 100),
('s583048','TDAT3023', 35.5),
('s583048','IFUD1123', 70),
('s128473','IFUD1048', 85),
('s128473','TDAT3023', 90);

8 rows affected.

[]

In [14]:
%sql select * from course_enrollment;

Done.

[('s485730', 'IFUD1123', 70.0),
 ('s485730', 'IFUD1048', 80.0),
 ('s129483', 'IFUD1048', 90.0),
 ('s129483', 'IFUD1123', 100.0),
 ('s583048', 'TDAT3023', 35.5),
 ('s583048', 'IFUD1123', 70.0),
 ('s128473', 'IFUD1048', 85.0),
 ('s128473', 'TDAT3023', 90.0)]

average grade for each courses

In [15]:
%%sql
select course_id, sum(grade)/count(grade) from course_enrollment group by course_id;

Done.

[('IFUD1048', 85.0), ('IFUD1123', 80.0), ('TDAT3023', 62.75)]

average grade for each courses, with course name

In [16]:
%%sql
select a.name, b.avg
from course a join
(
    select course_id, sum(grade)/count(grade) avg
    from course_enrollment 
    group by course_id
) b on a.course_id=b.course_id;

Done.

[('C++ for Programmers', 85.0),
 ('Big data', 80.0),
 ('3D Computer Graphics', 62.75)]

What courses are chosen by Emma Sagen? Show the course name.

In [17]:
%%sql
select a.name
from course a join
course_enrollment b
on a.course_id=b.course_id join
student c
on b.student_id=c.student_id
where c.first_name='Emma' and c.last_name='Sagen';

Done.

[('3D Computer Graphics',), ('Big data',)]

Calculate the credits obtained by each students. One student will get the credit of one course if the grade of that course is above 40.

In [18]:
%%sql
select a.student_id, a.first_name, a.last_name, sum(c.credits)
from student a join course_enrollment b
on a.student_id=b.student_id join course c
on b.course_id=c.course_id
where b.grade>=40
group by a.student_id, a.first_name, a.last_name

Done.

[('s128473', 'Maryam', 'Gulbrandsen', 20.0),
 ('s129483', 'Matilde', 'Lavik', 10.0),
 ('s485730', 'Silje', 'Thomassen', 10.0),
 ('s583048', 'Emma', 'Sagen', 5.0)]